ciaa/firmware_v1/externals/drivers/msp430/inc/msp430fr2xx_4xxgeneric.h
#define OFS_CPCTL0            (0x0000)  /* eComparator Control Register 0 */
#define OFS_CPCTL0_L           OFS_CPCTL0
#define OFS_CPCTL0_H           OFS_CPCTL0+1
#define OFS_CPCTL1            (0x0002)  /* eComparator Control Register 1 */
#define OFS_CPCTL1_L           OFS_CPCTL1
#define OFS_CPCTL1_H           OFS_CPCTL1+1
#define OFS_CPINT             (0x000C)  /* eComparator Interrupt Register */
#define OFS_CPINT_L            OFS_CPINT
#define OFS_CPINT_H            OFS_CPINT+1
#define OFS_CPIV              (0x000E)  /* eComparator Interrupt Vector Word */
#define OFS_CPIV_L             OFS_CPIV
#define OFS_CPIV_H             OFS_CPIV+1
#define OFS_CPDACCTL          (0x0010)  /* eComparator Built-in DAC control register */
#define OFS_CPDACCTL_L         OFS_CPDACCTL
#define OFS_CPDACCTL_H         OFS_CPDACCTL+1
#define OFS_CPDACDATA         (0x0012)  /* eComparator Built-in DAC data register */
#define OFS_CPDACDATA_L        OFS_CPDACDATA
#define OFS_CPDACDATA_H        OFS_CPDACDATA+1


/* CPCTL0 Control Bits */
#define CPPSEL0            (0x0001)  /* eComp. Pos. Channel Input Select 0 */
#define CPPSEL1            (0x0002)  /* eComp. Pos. Channel Input Select 1 */
#define CPPSEL2            (0x0004)  /* eComp. Pos. Channel Input Select 2 */
#define CPPEN              (0x0010)  /* eComp. Pos. Channel Input Enable */
#define CPNSEL0            (0x0100)  /* eComp. Neg. Channel Input Select 0 */
#define CPNSEL1            (0x0200)  /* eComp. Neg. Channel Input Select 1 */
#define CPNSEL2            (0x0400)  /* eComp. Neg. Channel Input Select 2 */
#define CPNEN              (0x1000)  /* eComp. Neg. Channel Input Enable */

/* CPCTL0 Control Bits */
#define CPPSEL0_L           (0x0001)  /* eComp. Pos. Channel Input Select 0 */
#define CPPSEL1_L           (0x0002)  /* eComp. Pos. Channel Input Select 1 */
#define CPPSEL2_L           (0x0004)  /* eComp. Pos. Channel Input Select 2 */
#define CPPEN_L             (0x0010)  /* eComp. Pos. Channel Input Enable */

/* CPCTL0 Control Bits */
#define CPNSEL0_H           (0x0001)  /* eComp. Neg. Channel Input Select 0 */
#define CPNSEL1_H           (0x0002)  /* eComp. Neg. Channel Input Select 1 */
#define CPNSEL2_H           (0x0004)  /* eComp. Neg. Channel Input Select 2 */
#define CPNEN_H             (0x0010)  /* eComp. Neg. Channel Input Enable */

#define CPPSEL_0           (0x0000)  /* eComp. V+ terminal Input Select: Channel 0 */
#define CPPSEL_1           (0x0001)  /* eComp. V+ terminal Input Select: Channel 1 */
#define CPPSEL_2           (0x0002)  /* eComp. V+ terminal Input Select: Channel 2 */
#define CPPSEL_3           (0x0003)  /* eComp. V+ terminal Input Select: Channel 3 */
#define CPPSEL_4           (0x0004)  /* eComp. V+ terminal Input Select: Channel 4 */
#define CPPSEL_5           (0x0005)  /* eComp. V+ terminal Input Select: Channel 5 */
#define CPPSEL_6           (0x0006)  /* eComp. V+ terminal Input Select: Channel 6 */
#define CPPSEL_7           (0x0007)  /* eComp. V+ terminal Input Select: Channel 7 */

#define CPNSEL_0           (0x0000)  /* eComp. V- Terminal Input Select: Channel 0 */
#define CPNSEL_1           (0x0100)  /* eComp. V- Terminal Input Select: Channel 1 */
#define CPNSEL_2           (0x0200)  /* eComp. V- Terminal Input Select: Channel 2 */
#define CPNSEL_3           (0x0300)  /* eComp. V- Terminal Input Select: Channel 3 */
#define CPNSEL_4           (0x0400)  /* eComp. V- Terminal Input Select: Channel 4 */
#define CPNSEL_5           (0x0500)  /* eComp. V- Terminal Input Select: Channel 5 */
#define CPNSEL_6           (0x0600)  /* eComp. V- Terminal Input Select: Channel 6 */
#define CPNSEL_7           (0x0700)  /* eComp. V- Terminal Input Select: Channel 7 */

/* CPCTL1 Control Bits */
#define CPOUT               (0x0001)  /* eComp. Output */
#define CPINV               (0x0002)  /* eComp. Output Polarity */
#define CPIES               (0x0010)  /* eComp. Interrupt Edge Select */
#define CPFLT               (0x0020)  /* eComp. Enable Output Filter */
#define CPFILTDLY0          (0x0040)  /* eComp. Filter delay Bit 0 */
#define CPFILTDLY1          (0x0080)  /* eComp. Filter delay Bit 1 */
#define CPMSEL              (0x0100)  /* eComp. Power mode selection */
#define CPEN                (0x0200)  /* eComp. enable */
#define CPHSEL0             (0x0400)  /* eComp. Programable Hysteresis mode Bit: 0 */
#define CPHSEL1             (0x0800)  /* eComp. Programable Hysteresis mode Bit: 1 */
#define CPIE                (0x4000)  /* eComp. Interrupt Enable */
#define CPIIE               (0x8000)  /* eComp. Inverted Interrupt Enable */

/* CPCTL1 Control Bits */
#define CPOUT_L             (0x0001)  /* eComp. Output */
#define CPINV_L             (0x0002)  /* eComp. Output Polarity */
#define CPIES_L             (0x0010)  /* eComp. Interrupt Edge Select */
#define CPFLT_L             (0x0020)  /* eComp. Enable Output Filter */
#define CPFILTDLY0_L        (0x0040)  /* eComp. Filter delay Bit 0 */
#define CPFILTDLY1_L        (0x0080)  /* eComp. Filter delay Bit 1 */

/* CPCTL1 Control Bits */
#define CPMSEL_H            (0x0001)  /* eComp. Power mode selection */
#define CPEN_H              (0x0002)  /* eComp. enable */
#define CPHSEL0_H           (0x0004)  /* eComp. Programable Hysteresis mode Bit: 0 */
#define CPHSEL1_H           (0x0008)  /* eComp. Programable Hysteresis mode Bit: 1 */
#define CPIE_H              (0x0040)  /* eComp. Interrupt Enable */
#define CPIIE_H             (0x0080)  /* eComp. Inverted Interrupt Enable */

#define CPFILTDLY_0        (0x0000)  /* eComp. Filter delay 0 : 450ns */
#define CPFILTDLY_1        (0x0040)  /* eComp. Filter delay 1 : 900ns */
#define CPFILTDLY_2        (0x0080)  /* eComp. Filter delay 2 : 1800ns */
#define CPFILTDLY_3        (0x00C0)  /* eComp. Filter delay 3 : 3600ns */

#define CPHSEL_0           (0x0000)  /* eComp. Programable Hysteresis mode 0 */
#define CPHSEL_1           (0x0400)  /* eComp. Programable Hysteresis mode 1 */
#define CPHSEL_2           (0x0800)  /* eComp. Programable Hysteresis mode 2 */
#define CPHSEL_3           (0x0C00)  /* eComp. Programable Hysteresis mode 3*/


